Revit 2027 API
SortingOrder Enumeration
 Enumerated type representing the sorting order of a collection of objects.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SortingOrder
Public Enumeration SortingOrder
public enum class SortingOrder
type SortingOrder
Members
Member name | Value | Description
Ascending | 1 |  Ascending sorting order
Descending | 2 |  Descending sorting order
See Also
Reference
Autodesk.Revit.DB Namespace